In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
from pandas import Series, DataFrame
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

## テストデータを作る

In [2]:
# NaNをいれたいときは、np.nan
df_test1 = DataFrame({'colA': ['A', 'A', 'B'],
                      'colB': ['one',np.nan, 'two'],
                      'colC': range(1, 4)})
                 
df_test2 = DataFrame(np.arange(9, 17).reshape((4, 2)), index=['a', 'b', 'c', 'd'],
                     columns=['col1', 'col2'])

In [3]:
df_test1

  colA colB  colC
0    A  one     1
1    A  NaN     2
2    B  two     3

In [4]:
df_test1.fillna(0)

  colA colB  colC
0    A  one     1
1    A    0     2
2    B  two     3

In [5]:
df_test2

   col1  col2
a     9    10
b    11    12
c    13    14
d    15    16

### データ操作の基礎
#### 結合

___Merge:___

In [6]:
dfa = DataFrame({'key': ['a', 'b', 'a', 'b', 'c', 'a'],'data1': range(6)})
dfb = DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
dfa.loc[1,"data1"] = np.nan

In [7]:
dfa

   data1 key
0    0.0   a
1    NaN   b
2    2.0   a
3    3.0   b
4    4.0   c
5    5.0   a

In [8]:
# 共通の同じ列名(key)で結合。ANDで結合のイメージ。
# NaNは放置。
# 何も指定しない場合、デフォルトではinner join
# howで明示的にinnerを指定しても上記と同じ
pd.merge(dfa, dfb) # how='inner'入れてよし

   data1 key  data2
0    0.0   a      0
1    2.0   a      0
2    5.0   a      0
3    NaN   b      1
4    3.0   b      1

In [9]:
# onで指定する場合も同じ。
pd.merge(dfa, dfb, on='key')

   data1 key  data2
0    0.0   a      0
1    2.0   a      0
2    5.0   a      0
3    NaN   b      1
4    3.0   b      1

In [10]:
dfc = DataFrame({'key03': ['a', 'b', 'a', 'b', 'c', 'a'],'data1': range(6)})
dfd = DataFrame({'key04': ['a', 'b', 'd'],'data2': range(3)})

In [11]:
# ANDのイメージ　
# key3とkey4を残す。
pd.merge(dfc, dfd, left_on='key03', right_on='key04')

   data1 key03  data2 key04
0      0     a      0     a
1      2     a      0     a
2      5     a      0     a
3      1     b      1     b
4      3     b      1     b

In [12]:
# 左を大事にした、ANDのイメージ
# 右にないところはNaNで埋める。
pd.merge(dfa, dfb, how='left')

   data1 key  data2
0    0.0   a    0.0
1    NaN   b    1.0
2    2.0   a    0.0
3    3.0   b    1.0
4    4.0   c    NaN
5    5.0   a    0.0

In [13]:
# 右を大事にした、ANDのイメージ
# 左にないところはNaNで埋める。
pd.merge(dfa, dfb, how='right')

   data1 key  data2
0    0.0   a      0
1    2.0   a      0
2    5.0   a      0
3    NaN   b      1
4    3.0   b      1
5    NaN   d      2

In [14]:
# ORのイメージ
# 両方にないところはNaNで埋める。
pd.merge(dfa, dfb, how='outer')

   data1 key  data2
0    0.0   a    0.0
1    2.0   a    0.0
2    5.0   a    0.0
3    NaN   b    1.0
4    3.0   b    1.0
5    4.0   c    NaN
6    NaN   d    2.0

In [15]:
dfe = DataFrame({'keyA': ['A', 'A', 'B'],
                 'keyB': ['one', 'two', 'two'],
                 'key5': range(1, 4)})

dff = DataFrame({'keyA': ['A', 'A', 'B', 'B'],
                 'keyB': ['one','one',  'two', 'two'],
                 'key6': range(4, 8)})

In [16]:
# デフォルトはinner join　→　だからANDのイメージ
pd.merge(dfe, dff, on=['keyA', 'keyB'])

   key5 keyA keyB  key6
0     1    A  one     4
1     1    A  one     5
2     3    B  two     6
3     3    B  two     7

In [17]:
#outerはORでした。ないところはNaN。
pd.merge(dfe, dff, on=['keyA', 'keyB'], how='outer')

   key5 keyA keyB  key6
0     1    A  one   4.0
1     1    A  one   5.0
2     2    A  two   NaN
3     3    B  two   6.0
4     3    B  two   7.0

In [18]:
# inner joinはあるところだけ。
# suffix に_xがつく。
pd.merge(dfe, dff, on='keyA') #suffixes=('_e', '_f') と書いてもよし。

   key5 keyA keyB_x  key6 keyB_y
0     1    A    one     4    one
1     1    A    one     5    one
2     2    A    two     4    one
3     2    A    two     5    one
4     3    B    two     6    two
5     3    B    two     7    two

___Merge + index___

In [19]:
# dfとindexでマージもできる。
indkey = DataFrame({'val': [100, 200]}, index=['a', 'b'])
pd.merge(dfa, indkey, left_on='key', right_index=True)

   data1 key  val
0    0.0   a  100
2    2.0   a  100
5    5.0   a  100
1    NaN   b  200
3    3.0   b  200

___Merge + 階層データ___

In [20]:
# 階層データでもマージ
df1 = DataFrame({'key1': ['Apple', 'Apple', 'Apple', 'Orange', 'Orange'],
                'price': [100, 200, 300, 200, 300],
                'num': np.arange(5)})
df2 = DataFrame(np.arange(12).reshape((6, 2)),
                index=[['Orange', 'Orange', 'Apple', 'Apple', 'Apple', 'Apple'],
                      [200, 100, 100, 100, 200, 300]],
                columns=['shop1', 'shop2'])
pd.merge(df1, df2, left_on=['key1', 'price'], right_index=True)

     key1  num  price  shop1  shop2
0   Apple    0    100      4      5
0   Apple    0    100      6      7
1   Apple    1    200      8      9
2   Apple    2    300     10     11
3  Orange    3    200      0      1

___join___

In [21]:
# join関数のデフォルトはleft joinになっている
dfg = DataFrame(np.arange(6).reshape((3, 2)), index=['a', 'c', 'e'],
                columns=['shop1', 'shop2'])
dfh = DataFrame(np.arange(7, 15).reshape((4, 2)), index=['b', 'c', 'd', 'e'],
                columns=['shop3', 'shop4'])

In [22]:
dfg.join(dfh)

   shop1  shop2  shop3  shop4
a      0      1    NaN    NaN
c      2      3    9.0   10.0
e      4      5   13.0   14.0

In [23]:
# inner join。ANDのイメージ
dfg.join(dfh, how='inner')

   shop1  shop2  shop3  shop4
c      2      3      9     10
e      4      5     13     14

In [24]:
dfg.join(dfh, how='outer')

   shop1  shop2  shop3  shop4
a    0.0    1.0    NaN    NaN
b    NaN    NaN    7.0    8.0
c    2.0    3.0    9.0   10.0
d    NaN    NaN   11.0   12.0
e    4.0    5.0   13.0   14.0

___join + 複数df___

In [25]:
# 複数dfでjoin
dfi = DataFrame(np.arange(9, 17).reshape((4, 2)), index=['a', 'b', 'e', 'f'],
                columns=['shop5', 'shop6'])
dfg.join([dfh, dfi])

   shop1  shop2  shop3  shop4  shop5  shop6
a      0      1    NaN    NaN    9.0   10.0
c      2      3    9.0   10.0    NaN    NaN
e      4      5   13.0   14.0   13.0   14.0

___concat___

In [26]:
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([5, 6], index=['f', 'g'])
# axis=0
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [27]:
# axis=1 / axis='columns'
pd.concat([s1, s2, s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [28]:
s1

a    0
b    1
dtype: int64

In [29]:
s4 = Series([0, 5, 5, 6], index=['a', 'b', 'f', 'g'])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [30]:
# join_axesを中心にs1 s4をジョインさせる。
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

In [31]:
# dfでもできる。
df91 = DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                 columns=['one', 'two'])

df92 = DataFrame(np.arange(4).reshape(2, 2), index=['a', 'c'],
                columns=['three', 'four'])
df93 = pd.concat([df91, df92], axis=1, keys=['001', '002'])

In [32]:
df93

  001       002
  one two three four
a   0   1   0.0  1.0
b   2   3   NaN  NaN
c   4   5   2.0  3.0

In [33]:
df93.loc[:,"001"]

   one  two
a    0    1
b    2    3
c    4    5